---
title: BoundaryConditions
classe: Autodesk.Revit.DB.Structure.BoundaryConditions
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# BoundaryConditions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId AssociatedLoadId { get; set; }` | `boundaryConditions.AssociatedLoadId` | ElementId |
| `ElementId HostElementId { get; }` | `boundaryConditions.HostElementId` | ElementId |
| `XYZ Point { get; }` | `boundaryConditions.Point` | XYZ |
| `BoundaryConditionsType GetBoundaryConditionsType()` | `boundaryConditions.GetBoundaryConditionsType()` | BoundaryConditionsType |
| `Curve GetCurve()` | `boundaryConditions.GetCurve()` | Curve |
| `Transform GetDegreesOfFreedomCoordinateSystem()` | `boundaryConditions.GetDegreesOfFreedomCoordinateSystem()` | Transform |
| `IList<CurveLoop> GetLoops()` | `boundaryConditions.GetLoops()` | IList<CurveLoop> |
| `BoundaryConditionsOrientTo GetOrientTo()` | `boundaryConditions.GetOrientTo()` | BoundaryConditionsOrientTo |
| `Void SetOrientTo(BoundaryConditionsOrientTo)` | `boundaryConditions.SetOrientTo(orientTo)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```